# Ultralytics AGPL-3.0 License - https://ultralytics.com/license
# YOLO11s-BSE v2: P2 detection + BiFPN + SPDConv + EMA + CA + SimAM + CARAFE + EdgeEnhancement
# Improvements over v1:
#   1. EdgeEnhancement moved to P2 level (128ch semantic features, not 32ch raw pixels)
#   2. Second CoordinateAttention replaced with SimAM (diverse, zero-parameter 3D attention)
#   3. nn.Upsample(nearest) replaced with CARAFE (content-aware upsampling)
#   4. SimAM added to bottom-up P3 output for extra attention
#   5. Detect P2 now takes from attention-enhanced features (#25 instead of #23)
# NWD loss for small object detection (set nwd: True in training config)

nc: 1
scales:
  s: [0.50, 0.50, 1024]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0 - stem conv
  - [-1, 1, SPDConv, [128]] # 1 - P2 downsample (detail-preserving)
  - [-1, 2, C3k2, [256, False, 0.25]] # 2 - P2 features
  - [-1, 1, EdgeEnhancement, []] # 3 - EE on 128ch semantic features (moved from shallow layer)
  - [-1, 1, SPDConv, [256]] # 4 - P3 downsample
  - [-1, 2, C3k2, [512, False, 0.25]] # 5
  - [-1, 1, SPDConv, [512]] # 6 - P4 downsample
  - [-1, 2, C3k2, [512, True]] # 7
  - [-1, 1, SPDConv, [1024]] # 8 - P5 downsample
  - [-1, 2, C3k2, [1024, True]] # 9
  - [-1, 1, SPPF, [1024, 5]] # 10
  - [-1, 2, C2PSA, [1024]] # 11

head:
  # ---- Top-down pathway with CARAFE content-aware upsampling ----
  - [-1, 1, Conv, [512, 1, 1]] # 12
  - [-1, 1, CARAFE, [2]] # 13 - content-aware upsample (was nn.Upsample)
  - [[-1, 7], 1, BiFPNAdd2, []] # 14 - fuse P5 and P4
  - [-1, 2, C3k2, [512, False]] # 15
  - [-1, 1, CARAFE, [2]] # 16 - content-aware upsample
  - [[-1, 5], 1, BiFPNAdd2, []] # 17 - fuse P4 and P3
  - [-1, 2, C3k2, [512, False]] # 18
  - [-1, 1, EMA, []] # 19 - channel-spatial attention at P3
  - [-1, 1, Conv, [256, 1, 1]] # 20
  - [-1, 1, CARAFE, [2]] # 21 - content-aware upsample
  - [[-1, 3], 1, BiFPNAdd2, []] # 22 - fuse with EE-enhanced P2 features
  - [-1, 2, C3k2, [256, False]] # 23
  # P2 diverse attention: CA (precise spatial) + SimAM (3D energy, zero-param)
  - [-1, 1, CoordinateAttention, []] # 24
  - [-1, 1, SimAM, []] # 25 - replaces second CA
  # ---- Bottom-up pathway ----
  - [-1, 1, Conv, [512, 3, 2]] # 26
  - [[-1, 18], 1, BiFPNAdd2, []] # 27
  - [-1, 2, C3k2, [512, False]] # 28
  - [-1, 1, SimAM, []] # 29 - P3 attention enhancement (new)
  - [-1, 1, Conv, [512, 3, 2]] # 30
  - [[-1, 15, 7], 1, BiFPNAdd3, []] # 31
  - [-1, 2, C3k2, [512, False]] # 32
  - [-1, 1, Conv, [1024, 3, 2]] # 33
  - [[-1, 11], 1, BiFPNAdd2, []] # 34
  - [-1, 2, C3k2, [1024, True]] # 35
  # Detect(P2, P3, P4, P5) - P2 now from attention-enhanced output
  - [[25, 29, 32, 35], 1, Detect, [nc]] # 36
